week2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-23 Mon 10:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Martin Fracker" />
</head>
<body>
<div id="content">
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Week 2</h2>
<div class="outline-text-2" id="text-orgheadline6">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Concepts</h3>
<div class="outline-text-3" id="text-orgheadline4">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1">Thinking Critically</h4>
<div class="outline-text-4" id="text-orgheadline1">
<ul class="org-ul">
<li>To think critically means you don't accept everything at face value. In a way,
you are skeptical, if only because you haven't been given a good reason to
accept it.</li>
<li>Thinking critically is one of the things that defines our intelligence. It
allows us to exercise our brains. Instead of taking something at face value,
and saying, "I learned something today," we can apply critical thinking to
use it as fuel for seeking more knowledge. On a social level it prepares us for
conversation in that it allows us to decide in advance what we believe and why.</li>
<li>Proofs are abundant in the theoretical aspects of computer science. In many
cases, it is particularly easy to prove something false; you simply need to
find one exception.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2">Fake News/Research</h4>
<div class="outline-text-4" id="text-orgheadline2">
<ul class="org-ul">
<li>Fake news/research is a huge problem. It plagues legislation, academics, and medicine.</li>
<li>With fake news/research being such a huge problem, it is more important
than ever to be skeptical of what you read, even published research.</li>
<li>When writing papers, it is important to screen articles before you use them for your
sources not only to ensure your papers are accurate but also because you will
have to cite them, and you do not want your paper to be attached to a journal
with a less than satisfactory reputation.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3">Experimenter Effects</h4>
<div class="outline-text-4" id="text-orgheadline3">
<ul class="org-ul">
<li>The phenomenon that occurs when the experimenter inadvertantly influences the
outcoume of his/her experiments</li>
<li>This ties into thinking critically and flawed research. The phenomenon of
the effect the experimenter can have on the experiment demonstrates how
important it is to question the validity of said experiment and derivative
research papers.</li>
<li>Once I watched a video of a man asking a bunch of people to figure out a
numerical rule he had in mind. In order to guess it they could say a
sequence of numbers, and he would tell them if it conformed to his rule.
People would offer numbers like [2, 4, 6], [3, 9, 27]. They basically
formed their own rule and proceeded to only inquire about sequences that
conformed to their own rule. After several attempts and getting very
frustrated, they finally realized that the key was to inquire about a
sequence that did not conform to any rule they were aware of. As soon as
one person inquired about [3, 2, 1] and [6, 4, 2] it became clear that the
rule they had to guess was numbers in increasing order. Being open-minded
and not blinding yourself, restricting yourself only to what you know, is
the key.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Think about</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>What authority will you have in your future as a 'professional'?
<ul class="org-ul">
<li>Determining the strategy of a project</li>
<li>Designing software architecture</li>
<li>Managing other developers</li>
</ul></li>
<li>Is 'engineering' a profession? Why? Does this tile have the potential for abuse?
<ul class="org-ul">
<li>It is a very broad profession.</li>
<li>Perhaps people not in the field of
engineering may call those in the field engineers. However, I think it
is more helpful to describe someone using a more specific title.</li>
<li>Because the title is so broad, it is very easy to claim someone is an
engineer, that he or she knows what she is doing, and what he or she says goes.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Martin Fracker</p>
<p class="date">Created: 2017-01-23 Mon 10:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
